In [1]:
#Experiment NO:3

In [2]:
#Aim:To perform Finding Statistical Descriptions of given data set using Pandas

In [3]:
#Name:Mohammed Maarij Ahmad

In [4]:
#Roll No:01

In [5]:
#Section:A

In [6]:
#Year:3rd

In [1]:
#importing the basic libraary
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
import seaborn as sns

In [5]:
import numpy as np

In [6]:
import os

In [7]:
os.getcwd()

'C:\\Users\\moham'

In [8]:
os.chdir('C:\\Users\\moham\\OneDrive\\Pictures\\Desktop')

In [9]:
df=pd.read_csv("Salary_Data.csv")

In [10]:
df.head(10)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0
7              3.2  54445.0
8              3.2  64445.0
9              3.7  57189.0

In [11]:
df.tail(10)

    YearsExperience    Salary
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [13]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [14]:
df.shape

(30, 2)

In [15]:
df.size

60

In [16]:
df.ndim

2

In [17]:
#Using Numpy
mean=np.mean(df)
median=np.median(df)
variance=np.var(df)
std_dev=np.std(df)

In [18]:
#Using pandas
df=pd.DataFrame(df,columns=["df"])
summary_stats=df.describe()

In [19]:
print(f"Mean:{mean}")

Mean:YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [20]:
print(f"Median:{median}")

Median:18870.75

In [21]:
print(f"Standard Deviation:{std_dev}")

Standard Deviation:YearsExperience        2.790189
Salary             26953.650249
dtype: float64

In [22]:
print(f"Variance:{variance}")

Variance:YearsExperience    7.785156e+00
Salary             7.264993e+08
dtype: float64

In [23]:
print(f"\nSummary Statistics:")

Summary Statistics:

In [34]:
print(summary_stats)

        df
count  0.0
mean   NaN
std    NaN
min    NaN
25%    NaN
50%    NaN
75%    NaN
max    NaN